Revit 2024 API
AdvancedOpaque Class
 A static class that provides access to the property names that appear in the AdvancedOpaque visual asset schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static class AdvancedOpaque
Visual Basic
Public NotInheritable Class AdvancedOpaque
Visual C++
public ref class AdvancedOpaque abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AdvancedOpaque
See Also
AdvancedOpaque Members
Autodesk.Revit.DB.Visual Namespace